balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF1455.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR1L_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="FSR1L_SHAD" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR1L_SHAD" edc:desc="" edc:mask="0xff" edc:name="FSR1L_SHAD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR1H_SHAD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="FSR1H_SHAD" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR1H_SHAD" edc:desc="" edc:mask="0xff" edc:name="FSR1H_SHAD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="STKPTR" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---xxxxx" edc:name="STKPTR" edc:nzwidth="8" edc:por="---xxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="STKPTR" edc:desc="" edc:mask="0x1f" edc:name="STKPTR" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TOSL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxx" edc:name="TOSL" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOSL" edc:desc="" edc:mask="0xff" edc:name="TOSL" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="TOSH" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-xxxxxxx" edc:name="TOSH" edc:nzwidth="8" edc:por="-xxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TOSH" edc:desc="" edc:mask="0x7f" edc:name="TOSH" edc:nzwidth="7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:DPRDataSector edc:bank="0" edc:beginaddr="0x20" edc:endaddr="0x70" edc:regionid="dpr0"/>
      <edc:DPRDataSector edc:bank="0" edc:beginaddr="0x70" edc:endaddr="0x80" edc:regionid="dprnobank"/>
      <edc:DPRDataSector edc:bank="1" edc:beginaddr="0xA0" edc:endaddr="0xF0" edc:regionid="dpr1"/>
      <edc:DPRDataSector edc:bank="1" edc:beginaddr="0xF0" edc:endaddr="0x100" edc:regionid="dpr1s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="2" edc:beginaddr="0x120" edc:endaddr="0x170" edc:regionid="dpr2"/>
      <edc:DPRDataSector edc:bank="2" edc:beginaddr="0x170" edc:endaddr="0x180" edc:regionid="dpr2s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="3" edc:beginaddr="0x1A0" edc:endaddr="0x1F0" edc:regionid="dpr3"/>
      <edc:DPRDataSector edc:bank="3" edc:beginaddr="0x1F0" edc:endaddr="0x200" edc:regionid="dpr3s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="4" edc:beginaddr="0x220" edc:endaddr="0x270" edc:regionid="dpr4"/>
      <edc:DPRDataSector edc:bank="4" edc:beginaddr="0x270" edc:endaddr="0x280" edc:regionid="dpr4s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="5" edc:beginaddr="0x2A0" edc:endaddr="0x2F0" edc:regionid="dpr5"/>
      <edc:DPRDataSector edc:bank="5" edc:beginaddr="0x2F0" edc:endaddr="0x300" edc:regionid="dpr5s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="6" edc:beginaddr="0x320" edc:endaddr="0x330" edc:regionid="dpr6"/>
      <edc:EmulatorZone edc:beginaddr="0xf8c" edc:endaddr="0xfab" edc:regionid="emulatorzone"/>
      <edc:GPRDataSector edc:bank="6" edc:beginaddr="0x330" edc:endaddr="0x370" edc:regionid="gpr6"/>
      <edc:DPRDataSector edc:bank="6" edc:beginaddr="0x370" edc:endaddr="0x380" edc:regionid="dpr6s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="7" edc:beginaddr="0x3A0" edc:endaddr="0x3F0" edc:regionid="gpr7"/>
      <edc:DPRDataSector edc:bank="7" edc:beginaddr="0x3F0" edc:endaddr="0x400" edc:regionid="dpr7s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="8" edc:beginaddr="0x420" edc:endaddr="0x470" edc:regionid="gpr8"/>
      <edc:DPRDataSector edc:bank="8" edc:beginaddr="0x470" edc:endaddr="0x480" edc:regionid="dpr8s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="9" edc:beginaddr="0x4A0" edc:endaddr="0x4F0" edc:regionid="gpr9"/>
      <edc:DPRDataSector edc:bank="9" edc:beginaddr="0x4F0" edc:endaddr="0x500" edc:regionid="dpr9s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="10" edc:beginaddr="0x520" edc:endaddr="0x570" edc:regionid="gpr10"/>
      <edc:DPRDataSector edc:bank="10" edc:beginaddr="0x570" edc:endaddr="0x580" edc:regionid="dpr10s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="11" edc:beginaddr="0x5A0" edc:endaddr="0x5F0" edc:regionid="gpr11"/>
      <edc:DPRDataSector edc:bank="11" edc:beginaddr="0x5F0" edc:endaddr="0x600" edc:regionid="dpr11s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:GPRDataSector edc:bank="12" edc:beginaddr="0x620" edc:endaddr="0x650" edc:regionid="gpr12"/>
      <edc:DPRDataSector edc:bank="12" edc:beginaddr="0x670" edc:endaddr="0x680" edc:regionid="dpr12s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="13" edc:beginaddr="0x6F0" edc:endaddr="0x700" edc:regionid="dpr13s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="14" edc:beginaddr="0x770" edc:endaddr="0x780" edc:regionid="dpr14s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="15" edc:beginaddr="0x7F0" edc:endaddr="0x800" edc:regionid="dpr15s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="16" edc:beginaddr="0x870" edc:endaddr="0x880" edc:regionid="dpr16s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="17" edc:beginaddr="0x8F0" edc:endaddr="0x900" edc:regionid="dpr17s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="18" edc:beginaddr="0x970" edc:endaddr="0x980" edc:regionid="dpr18s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="19" edc:beginaddr="0x9F0" edc:endaddr="0xA00" edc:regionid="dpr19s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="20" edc:beginaddr="0xA70" edc:endaddr="0xA80" edc:regionid="dpr20s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="21" edc:beginaddr="0xAF0" edc:endaddr="0xB00" edc:regionid="dpr21s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="22" edc:beginaddr="0xB70" edc:endaddr="0xB80" edc:regionid="dpr22s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="23" edc:beginaddr="0xBF0" edc:endaddr="0xC00" edc:regionid="dpr23s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="24" edc:beginaddr="0xC70" edc:endaddr="0xC80" edc:regionid="dpr24s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="25" edc:beginaddr="0xCF0" edc:endaddr="0xD00" edc:regionid="dpr25s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="26" edc:beginaddr="0xD70" edc:endaddr="0xD80" edc:regionid="dpr26s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="27" edc:beginaddr="0xDF0" edc:endaddr="0xE00" edc:regionid="dpr27s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="28" edc:beginaddr="0xE70" edc:endaddr="0xE80" edc:regionid="dpr28s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="29" edc:beginaddr="0xEF0" edc:endaddr="0xF00" edc:regionid="dpr29s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="30" edc:beginaddr="0xF70" edc:endaddr="0xF80" edc:regionid="dpr30s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
      <edc:DPRDataSector edc:bank="31" edc:beginaddr="0xFF0" edc:endaddr="0x1000" edc:regionid="dpr31s" edc:shadowidref="dprnobank" edc:shadowoffset="0"/>
    </edc:RegardlessOfMode>
    <edc:TraditionalModeOnly/>
    <edc:ExtendedModeOnly/>
  </edc:DataSpace>
  <edc:PinList>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA5"/>
      <edc:VirtualPin edc:name="IOC"/>
      <edc:VirtualPin edc:name="T1CKI"/>
      <edc:VirtualPin edc:name="PWM2_ALT"/>
      <edc:VirtualPin edc:name="T1OSCI"/>
      <edc:VirtualPin edc:name="CLKIN"/>
      <edc:VirtualPin edc:name="OSC1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA4"/>
      <edc:VirtualPin edc:name="IOC"/>
      <edc:VirtualPin edc:name="SDO_ALT"/>
      <edc:VirtualPin edc:name="T1G_PRI"/>
      <edc:VirtualPin edc:name="CLKR_PRI"/>
      <edc:VirtualPin edc:name="AN3"/>
      <edc:VirtualPin edc:name="T1OSCO"/>
      <edc:VirtualPin edc:name="CLKOUT"/>
      <edc:VirtualPin edc:name="OSC2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA3"/>
      <edc:VirtualPin edc:name="IOC"/>
      <edc:VirtualPin edc:name="SS_n_ALT"/>
      <edc:VirtualPin edc:name="T1G_ALT"/>
      <edc:VirtualPin edc:name="MCLR_n"/>
      <edc:VirtualPin edc:name="ICDMCLR_n"/>
      <edc:VirtualPin edc:name="VPP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC5_"/>
      <edc:VirtualPin edc:name="RX_DT"/>
      <edc:VirtualPin edc:name="T0CKI"/>
      <edc:VirtualPin edc:name="PWM1"/>
      <edc:VirtualPin edc:name="CWGOUTA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC4_"/>
      <edc:VirtualPin edc:name="TX_CK"/>
      <edc:VirtualPin edc:name="C2OUT"/>
      <edc:VirtualPin edc:name="C1OUT"/>
      <edc:VirtualPin edc:name="CWGOUTB"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC3_"/>
      <edc:VirtualPin edc:name="SS_n_PRI"/>
      <edc:VirtualPin edc:name="PWM2_PRI"/>
      <edc:VirtualPin edc:name="CLKR_ALT"/>
      <edc:VirtualPin edc:name="C2IN3-"/>
      <edc:VirtualPin edc:name="C1IN3-"/>
      <edc:VirtualPin edc:name="AN7"/>
      <edc:VirtualPin edc:name="DACOUT2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC2_"/>
      <edc:VirtualPin edc:name="SDO_PRI"/>
      <edc:VirtualPin edc:name="C2IN2-"/>
      <edc:VirtualPin edc:name="C1IN2-"/>
      <edc:VirtualPin edc:name="AN6"/>
      <edc:VirtualPin edc:name="DACOUT1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC1_"/>
      <edc:VirtualPin edc:name="INT"/>
      <edc:VirtualPin edc:name="SDI"/>
      <edc:VirtualPin edc:name="SDA"/>
      <edc:VirtualPin edc:name="CWGFLT_n"/>
      <edc:VirtualPin edc:name="C2IN1-"/>
      <edc:VirtualPin edc:name="C1IN1-"/>
      <edc:VirtualPin edc:name="AN5"/>
      <edc:VirtualPin edc:name="ICDCLK"/>
      <edc:VirtualPin edc:name="ICSPCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RC0_"/>
      <edc:VirtualPin edc:name="SCK"/>
      <edc:VirtualPin edc:name="SCL"/>
      <edc:VirtualPin edc:name="C2IN+"/>
      <edc:VirtualPin edc:name="C1IN+"/>
      <edc:VirtualPin edc:name="AN4"/>
      <edc:VirtualPin edc:name="VREF+ADC"/>
      <edc:VirtualPin edc:name="VREF+DAC"/>
      <edc:VirtualPin edc:name="ICDDAT"/>
      <edc:VirtualPin edc:name="ICSPDAT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VUSB"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA1"/>
      <edc:VirtualPin edc:name="IOC"/>
      <edc:VirtualPin edc:name="D-"/>
      <edc:VirtualPin edc:name="ICSPCLK"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="RA0"/>
      <edc:VirtualPin edc:name="IOC"/>
      <edc:VirtualPin edc:name="D+"/>
      <edc:VirtualPin edc:name="ICSPDAT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VSS"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>